|Variable|Definition|Key|
|---|---|---|
|survival|Survival|0 = No, 1 = Yes|
|pclass|Ticket class|1 = 1st, 2 = 2nd, 3 = 3rd|
|gender|gender ||
|Age |Age in years| |
|sibsp |number of siblings / spouses aboard|	|
|parch |number of parents / children aboard| |
|ticket|Ticket number ||
|fare | fare| 	|
|cabin |Cabin number|	|
|embarked|Port of Embarkation|C = Cherbourg, Q = Queenstown, S = Southampton|
|boat | Lifeboat||
|body | Body Identification Number||
|home.dest| Home/destination||

- Read data and describe it
- Find columns with missingdata
- Print shape of dataset
- drop columns with more than 25% missing data
- drop columns having independent values(which do not affect the survival rate).


- check data types of all columns
- convert price to numeric
- find columns still having missing/na values and also count of missing data
- fill na with mean for fare and age column column.
- drop na values for embarked column.
- dump the dataframe to a csv file 'titanic_filtered.csv'.


- for surviced column replace 0 with D and 1 with A
- find the frequency of different values in survived column
- group by gender and survived and see the counts in each category
- find different pclass and no of people in each class

- find top 5 people with highest values of age. Count no of male and females in the top 5
- find max age male and female who survived
- get average age by gender
- get average age by people survived vs not-survived

In [1]:
import numpy as np
import pandas as pd
#pd.set_option('display.max_rows',1309)

In [24]:
#Read data and describe it
ds = pd.read_csv('titanic_dataset.csv',index_col=0)
ds.describe()
#ds.set_operation('display.max_rows',1309)

,pclass,survived,age,sibsp,parch,body
count,1309.000000,1309.000000,1046.000000,1309.000000,1309.000000,121.000000
mean,2.294882,0.381971,29.881135,0.498854,0.385027,160.809917
std,0.837836,0.486055,14.413500,1.041658,0.865560,97.696922
min,1.000000,0.000000,0.166700,0.000000,0.000000,1.000000
25%,2.000000,0.000000,21.000000,0.000000,0.000000,72.000000
50%,3.000000,0.000000,28.000000,0.000000,0.000000,155.000000
75%,3.000000,1.000000,39.000000,1.000000,0.000000,256.000000
max,3.000000,1.000000,80.000000,8.000000,9.000000,328.000000

In [25]:
# Find columns with missingdata
ds.columns[ds.isna().any()]

Index(['age', 'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest'], dtype='object')

In [26]:
# Print shape of dataset
ds.shape

(1309, 14)

In [28]:
# drop columns with more than 25% missing data
print(ds.columns)
ds.dropna(axis=1,thresh=((0.75)*ds.shape[0]),inplace=True)
ds.columns

Index(['pclass', 'survived', 'name', 'gender', 'age', 'sibsp', 'parch',
       'ticket', 'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest'],
      dtype='object')

Index(['pclass', 'survived', 'name', 'gender', 'age', 'sibsp', 'parch',
       'ticket', 'fare', 'embarked'],
      dtype='object')

In [29]:
# drop columns having independent values(which do not affect the survival rate).
ds.drop(['name','ticket'],axis=1,inplace=True)

In [30]:
ds.columns

Index(['pclass', 'survived', 'gender', 'age', 'sibsp', 'parch', 'fare',
       'embarked'],
      dtype='object')

In [31]:
# check data types of all columns
ds.dtypes

pclass        int64
survived      int64
gender       object
age         float64
sibsp         int64
parch         int64
fare         object
embarked     object
dtype: object

In [33]:
# convert price to numeric
ds['fare']
ds['fare']=ds['fare'].str.replace('$','')
ds['fare']

0       211.34
1       151.55
2       151.55
3       151.55
4       151.55
         ...
1304     14.45
1305     14.45
1306      7.23
1307      7.23
1308      7.88
Name: fare, Length: 1309, dtype: object

In [54]:
# -find columns still having missing/na values and also count of missing data
na_vals=dict(zip(ds.columns[ds.isna().any()],[ds[i].isna().sum() for i in r]))
print(na_vals)

{'age': 263, 'fare': 1, 'embarked': 2}

In [56]:
ds.columns

Index(['pclass', 'survived', 'gender', 'age', 'sibsp', 'parch', 'fare',
       'embarked'],
      dtype='object')

In [69]:
# fill na with mean for fare and age column column.
ds['fare'] = ds['fare'].astype('float64') # since fare contains np.nan which is of float type 
ds['fare'].fillna(ds['fare'].mean(),inplace=True)
ds['age'].fillna(ds['age'].mean(),inplace=True)
# validation for non na values
print(ds['age'].isna().any(),':',ds['fare'].isna().any())

False : False

In [73]:
# drop na values for embarked column.
ds['embarked'].isna().sum()
print(ds.isna().sum())
ds.dropna(inplace=True)
print(ds.isna().sum())

pclass      0
survived    0
gender      0
age         0
sibsp       0
parch       0
fare        0
embarked    2
dtype: int64
pclass      0
survived    0
gender      0
age         0
sibsp       0
parch       0
fare        0
embarked    0
dtype: int64

In [74]:
# dump the dataframe to a csv file 'titanic_filtered.csv'.
ds.to_csv('titanic_filtered.csv')

In [75]:
ds['survived'].unique()

array([1, 0], dtype=int64)

In [76]:
# for surviced column replace 0 with D and 1 with A
ds['survived']= ds['survived'].replace({0:'D',1:'A'}) 
ds['survived']

0       A
1       A
2       D
3       D
4       D
       ..
1304    D
1305    D
1306    D
1307    D
1308    D
Name: survived, Length: 1307, dtype: object

In [79]:
# find the frequency of different values in survived column
ds['survived'].value_counts()

D    809
A    498
Name: survived, dtype: int64

In [114]:
# group by gender and survived and see the counts in each category
grp =ds.groupby(['gender','survived'])
print(grp.size())

gender  survived
female  A           337
        D           127
male    A           161
        D           682
dtype: int64

In [117]:
# find different pclass and no of people in each class
print(ds['pclass'].unique())
ds['pclass'].value_counts()

[1 2 3]

3    709
1    321
2    277
Name: pclass, dtype: int64

In [118]:
# find top 5 people with highest values of age. Count no of male and females in the top 5
ds.sort_values(by='age',ascending=False).head()

      pclass survived  gender   age  sibsp  parch   fare embarked
14         1        A    male  80.0      0      0  30.00        S
61         1        A  female  76.0      1      0  78.85        S
1235       3        D    male  74.0      0      0   7.78        S
135        1        D    male  71.0      0      0  34.65        C
9          1        D    male  71.0      0      0  49.50        C

In [120]:

ds.sort_values(by='age',ascending=False).head().gender.value_counts()

male      4
female    1
Name: gender, dtype: int64

In [128]:
# find max age male and female who survived
print("Max_Male :",ds.loc[(ds['survived']=='A') &(ds['gender']=='male')].age.max())
print("Max_FeMale :",ds.loc[(ds['survived']=='A') &(ds['gender']=='female')].age.max())

Max_Male : 80.0
Max_FeMale : 76.0

In [131]:
#get average age by gender
avg1 = ds.groupby(by='gender').age.mean()
print(avg1)

gender
female    28.795931
male      30.430716
Name: age, dtype: float64

In [133]:
# get average age by people survived vs not-survived
avg2 = ds.groupby(by='survived').age.mean()
print(avg2)

survived
A    28.974711
D    30.389368
Name: age, dtype: float64